package constructors;

public class ConstructorsTutorial {

//    Важные замечания о конструкторах Java
//    Конструкторы вызываются неявно при создании экземпляров объектов.
//    Два правила создания конструктора:

//            1. Имя конструктора должно совпадать с именем класса.
//            2. Конструктор Java не должен иметь возвращаемого типа.

//    Если класс не имеет конструктора, компилятор Java автоматически создает конструктор по умолчанию во время выполнения. Конструктор по умолчанию инициализирует переменные экземпляра значениями по умолчанию. Например, intпеременная будет инициализирована как0
//    Типы конструкторов:
//    Конструктор без аргументов — конструктор, не принимающий никаких аргументов.
//    Параметризованный конструктор — конструктор, принимающий аргументы.
//    Конструктор по умолчанию — конструктор, который автоматически создается компилятором Java,
//    если он явно не определен.
//    Конструктор не может быть abstract или static или final.
//    Конструктор можно перегрузить, но нельзя переопределить.

}
