package functional_Interface;

public class FunctionalInterfaceTypes {

//    Функциональные интерфейсы могут содержать только один абстрактный метод.
//    Они могут также содержать дополнительные методы по умолчанию или статические методы.
//    Функциональные интерфейсы могут быть использованы для создания лямбда-выражений,
//    которые представляют собой анонимные функции.
//    Функциональные интерфейсы могут быть использованы в контексте функционального программирования,
//    где функции рассматриваются как объекты первого класса.


//    Примеры функциональных интерфейсов в Java:
//
//    Runnable - представляет собой функциональный интерфейс,
//    который может быть использован для запуска потока выполнения.
//    Comparator - представляет собой функциональный интерфейс,
//    который может быть использован для сравнения объектов.
//    Consumer - представляет собой функциональный интерфейс,
//    который может быть использован для выполнения операций над объектами без возвращаемого значения.
//    Function - представляет собой функциональный интерфейс,
//    который может быть использован для преобразования одного типа данных в другой.
//    Predicate - представляет собой функциональный интерфейс,
//    который может быть использован для проверки условия на объекте.
}
