package variables;

public class Variables {

//    Переменные Java
//Переменная — это область памяти (хранилище) для хранения данных.

//    Тип данных int предполагает, что переменная может содержать только целые числа.
//    int speedLimit = 80;
//
//    int speedLimitSecond;
//    speedLimitSecond = 80;

//    Примечание: Java — статически типизированный язык.
//    Это означает, что все переменные должны быть объявлены до того, как их можно будет использовать.

//    Изменить значения переменных

//    int speedLimit = 80;

//    speedLimit = 90;

//    Не беспокойтесь об этом сейчас. Просто помните, что мы не можем сделать что-то вроде этого:
//
//    int speedLimit = 80;
//    float speedLimit;


//    Java-литералы
//    Литералы — это данные, используемые для представления фиксированных значений.

//    int a = 1;
//    float b = 2.5;
//    char c = 'F';
//    Здесь , 1, 2.5 и 'F' являются литералами.
//
//В Java существуют различные типы литералов.



}
