package final_keyword;

public class Final_base {

//    В Java final ключевое слово используется для обозначения констант.
//    Его можно использовать с переменными, методами и классами.

//    После того, как любая сущность (переменная, метод или класс) объявлена final, она может быть назначена только один раз. То есть,
//
//    1. final переменная не может быть повторно инициализирована другим значением
//    2. final метод не может быть переопределен
//    3. final класс не может быть продлен


    public static void main(String[] args) {
//      В приведенной выше программе мы создали final переменную с именем AGE.
////    И мы попытались изменить значение final переменной.
////    При запуске программы мы получим ошибку компиляции со следующим сообщением.
//        // create a final variable
//        final int AGE = 32;
//
//        // try to change the final variable
//        AGE = 45;
//        System.out.println("Age: " + AGE);
    }
}
